[
  {
    "title": "Section 302 – Punishment for Murder",
    "description": "Defines the punishment for committing murder under the IPC.",
    "content": "Whoever commits murder shall be punished with death or imprisonment for life, and shall also be liable to fine.",
    "category": "criminal",
    "type": "ipc"
  },
  {
    "title": "Section 375 – Rape",
    "description": "Defines the offence of rape under IPC.",
    "content": "A man is said to commit 'rape' if he has sexual intercourse with a woman under certain circumstances without her consent.",
    "category": "criminal",
    "type": "ipc"
  },
  {
    "title": "Section 379 – Theft",
    "description": "Punishment for committing theft under IPC.",
    "content": "Whoever commits theft shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
    "category": "criminal",
    "type": "ipc"
  },
  {
    "title": "Section 10 – Law of Contract",
    "description": "Defines the essential elements of a valid contract under the Indian Contract Act.",
    "content": "All agreements are contracts if they are made by the free consent of parties competent to contract, for a lawful consideration and with a lawful object.",
    "category": "civil",
    "type": "contract"
  },
  {
    "title": "Section 73 – Compensation for Breach of Contract",
    "description": "Details the right to claim damages when a contract is broken.",
    "content": "When a contract has been broken, the party who suffers is entitled to receive compensation for any loss or damage caused to him thereby.",
    "category": "civil",
    "type": "contract"
  },
  {
    "title": "Section 5 – Transfer of Property Act",
    "description": "Defines what constitutes the transfer of property in India.",
    "content": "In the following sections 'transfer of property' means an act by which a living person conveys property, in present or in future, to one or more other living persons.",
    "category": "civil",
    "type": "property"
  }
]
